{
  "kind": "template",
  "properties": {
    "displayName": "Create Workspace",
    "description": "Creates a central logging workspace, central storage account for additional logging, add update management and automation account.",
    "template": {
      "$schema": "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#",
      "contentVersion": "1.0.0.0",
      "parameters": {
        "Organization_Name": {
          "type": "string",
          "defaultValue": "Severn-LAWS"
        },
        "data-retention": {
          "type": "int",
          "defaultValue": 365,
          "minValue": 0,
          "maxValue": 730,
          "metadata": {
            "displayName": "Log retention in days",
            "description": "Number of days data will be retained for"
          }
        },
        "location": {
          "type": "string",
          "defaultValue": "East US",
          "metadata": {
            "displayName": "Location",
            "description": "Region used when establishing the workspace"
          },
          "allowedValues": [
            "Australia Central",
            "Australia East",
            "Australia Southeast",
            "Brazil South",
            "Canada Central",
            "Central India",
            "Central US",
            "East Asia",
            "East US",
            "East US 2",
            "France Central",
            "Japan East",
            "Korea Central",
            "North Central US",
            "North Europe",
            "South Africa North",
            "South Central US",
            "Southeast Asia",
            "UK South",
            "UK West",
            "West Europe",
            "West US",
            "West US 2",
            "USGov Virginia",
            "USGov Iowa",
            "USDoD East",
            "USDoD Central",
            "USGov Texas",
            "USGov Arizona"
          ]
        },
        "automationAccountName": {
          "type": "string",
          "defaultValue": "SevernAA",
          "metadata": {
            "description": "Automation account name"
          }
        },
        "automationAccountLocation": {
          "type": "string",
          "defaultValue": "East US 2",
          "metadata": {
            "description": "Specify the location in which to create the Automation account."
          },
          "allowedValues": [
            "Australia Central",
            "Australia East",
            "Australia Southeast",
            "Brazil South",
            "Canada Central",
            "Central India",
            "Central US",
            "East Asia",
            "East US",
            "East US 2",
            "France Central",
            "Japan East",
            "Korea Central",
            "North Central US",
            "North Europe",
            "South Africa North",
            "South Central US",
            "Southeast Asia",
            "UK South",
            "UK West",
            "West Europe",
            "West US",
            "West US 2",
            "USGov Virginia",
            "USGov Iowa",
            "USDoD East",
            "USDoD Central",
            "USGov Texas",
            "USGov Arizona"
          ]
        },
        "workbookId": {
          "type": "string",
          "defaultValue": "[newGuid()]",
          "metadata": {
            "description": "The unique guid for this workbook instance"
          }
        }
      },
      "variables": {
        "deployment-prefix": "[concat(parameters('Organization_Name'), '-sharedsvcs')]",
        "uniqueString": "[uniqueString(subscription().id, concat(variables('deployment-prefix'), '-log'))]",
        "diagnostic-storageAccount-prefix": "[concat(replace(variables('deployment-prefix'), '-', ''), 'diag')]",
        "diagnostic-storageAccount-name": "[toLower(substring(replace(concat(variables('diagnostic-storageAccount-prefix'), variables('uniqueString'), variables('uniqueString')), '-', ''), 0, 23) )]",
        "workspace-name": "[concat(variables('deployment-prefix'), '-log')]",
        "workbookDisplayName": "[concat(parameters('Organization_Name'),'hdi metrics')]",
        "solutionArray": {
          "solutions" : [
            {
              "name": "[concat('Updates', '(', variables('workspace-name'), ')')]",
              "galleryName": "Updates"
            },
            {
              "name": "[concat('ChangeTracking', '(', variables('workspace-name'), ')')]",
          "galleryName": "ChangeTracking"
            },
           {
            "name": "[concat('Security', '(', variables('workspace-name'), ')')]",
            "galleryName": "Security"
           },
           {
            "name": "[concat('SecurityCenterFree', '(', variables('workspace-name'), ')')]",
            "galleryName": "SecurityCenterFree"
           },
           {
            "name": "[concat('HDInsightHadoop', '(', variables('workspace-name'), ')')]",
            "galleryName": "HDInsightHadoop"
           },
           {
            "name": "[concat('VMInsights', '(', variables('workspace-name'), ')')]",
            "galleryName": "VMInsights"
           },
           {
            "name": "[concat('SecurityInsights', '(', variables('workspace-name'), ')')]",
            "galleryName": "SecurityInsights"
           }     
          ]
        }
      },
      "resources": [
        {
          "comments": "----DIAGNOSTICS STORAGE ACCOUNT-----",
          "type": "Microsoft.Storage/storageAccounts",
          "name": "[variables('diagnostic-storageAccount-name')]",
          "apiVersion": "2018-07-01",
          "location": "[resourceGroup().location]",
          "kind": "StorageV2",
          "sku": {
            "name": "Standard_LRS"
          },
          "tags": {
            "displayName": "Storage Account"
          },
          "properties": {
            "encryption": {
              "keySource": "Microsoft.Storage",
              "services": {
                "blob": {
                  "enabled": true
                },
                "file": {
                  "enabled": true
                }
              }
            },
            "supportsHttpsTrafficOnly": true
          }
        },
        {
          "type": "Microsoft.Storage/storageAccounts/providers/locks",
          "apiVersion": "2016-09-01",
          "name": "[concat(variables('diagnostic-storageAccount-name'), '/Microsoft.Authorization/storageDoNotDelete')]",
          "dependsOn": [
            "[concat('Microsoft.Storage/storageAccounts/', variables('diagnostic-storageAccount-name'))]"
          ],
          "comments": "Resource lock on diagnostic storage account",
          "properties": {
            "level": "CannotDelete"
          }
        },
        {
          "type": "Microsoft.OperationalInsights/workspaces",
          "name": "[variables('workspace-name')]",
          "apiVersion": "2017-03-15-preview",
          "location": "[parameters('location')]",
          "tags": {
            "displayName": "Log Analytics"
          },
          "properties": {
            "sku": {
              "Name": "pergb2018"
            },
            "retention": "[parameters('data-retention')]"
          },
          "resources": [
            {
              "apiVersion": "2015-11-01-preview",
              "type": "datasources",
              "name": "sampleWindowsEvent1",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "kind": "WindowsEvent",
              "properties": {
                "eventLogName": "Application",
                "eventTypes": [
                  {
                    "eventType": "Error"
                  },
                  {
                    "eventType": "Warning"
                  }
                ]
              }
            },
            {
              "apiVersion": "2015-11-01-preview",
              "type": "datasources",
              "name": "sampleWindowsPerfCounter1",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "kind": "WindowsPerformanceCounter",
              "properties": {
                "objectName": "Memory",
                "instanceName": "*",
                "intervalSeconds": 10,
                "counterName": "Available MBytes"
              }
            },
            {
              "apiVersion": "2015-11-01-preview",
              "type": "datasources",
              "name": "sampleIISLog1",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "kind": "IISLogs",
              "properties": {
                "state": "OnPremiseEnabled"
              }
            },
            {
              "apiVersion": "2015-11-01-preview",
              "type": "datasources",
              "name": "sampleSyslog1",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "kind": "LinuxSyslog",
              "properties": {
                "syslogName": "kern",
                "syslogSeverities": [
                  {
                    "severity": "emerg"
                  },
                  {
                    "severity": "alert"
                  },
                  {
                    "severity": "crit"
                  },
                  {
                    "severity": "err"
                  },
                  {
                    "severity": "warning"
                  }
                ]
              }
            },
            {
              "apiVersion": "2015-11-01-preview",
              "type": "datasources",
              "name": "sampleSyslogCollection1",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "kind": "LinuxSyslogCollection",
              "properties": {
                "state": "Enabled"
              }
            },
            {
              "apiVersion": "2015-11-01-preview",
              "type": "datasources",
              "name": "sampleLinuxPerf1",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "kind": "LinuxPerformanceObject",
              "properties": {
                "performanceCounters": [
                  {
                    "counterName": "% Used Inodes"
                  },
                  {
                    "counterName": "Free Megabytes"
                  },
                  {
                    "counterName": "% Used Space"
                  },
                  {
                    "counterName": "Disk Transfers/sec"
                  },
                  {
                    "counterName": "Disk Reads/sec"
                  },
                  {
                    "counterName": "Disk Writes/sec"
                  }
                ],
                "objectName": "Logical Disk",
                "instanceName": "*",
                "intervalSeconds": 10
              }
            },
            {              
              "type": "savedSearches",
              "apiVersion": "2017-04-26-preview",
              "name": "Scenario1 Activity Logs",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "properties": {
                "eTag": "*",
                "category": "Scenario1",
                "displayName": "Scenario1 Azure Activity",
                "query": "AzureActivity | where TimeGenerated > ago(24h) | where Caller contains \"scenario1\" | | extend localTimeStamp = TimeGenerated - 4h",
                "Version": 2
              }
            },
            {              
              "type": "savedSearches",
              "apiVersion": "2017-04-26-preview",
              "name": "Scenario1 Sign-In",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "properties": {
                "eTag": "*",
                "category": "Scenario1",
                "displayName": "Scenario1 Sign-In",
                "query": "SigninLogs | where TimeGenerated > ago(24h) | where Identity contains \"scenario1\" | extend localTimeStamp = TimeGenerated - 4h | limit 10",
                "Version": 2
              }
            },
            {              
              "type": "savedSearches",
              "apiVersion": "2017-04-26-preview",
              "name": "Scenario2 Bastion Bad Password",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "properties": {
                "etag": "*",
                "Category": "Scenario2",
                "DisplayName": "Scenario2 - Bastion Bad Password",
                "Query": "SecurityEvent\r\n| where TimeGenerated > ago(10m)\r\n| where Computer == 'scenario1VM'\r\n| where EventID == 4625\r\n| extend localTimeGenerated = TimeGenerated - (4h)\r\n| order by localTimeGenerated asc\r\n\r\n\r\nAzureActivity\r\n| where TimeGenerated > ago(10m)\r\n| where Caller contains \"scenario2\"\r\n| extend localTimeGenerated = TimeGenerated - (4h)\r\n| order by localTimeGenerated asc\r\n\r\n// Optional Bad Password search with example of lookup table for reason description\r\nlet ReasonTable=datatable(Status:string, ErrDescription:string) [ \r\n\"0xc000006d\",\t\"This is either due to a bad username or authentication information\",\r\n\"0xc000006e\",\t\"Unknown user name or bad password.\",\r\n\"0xc0000193\",\t\"account expiration\",\r\n\"0xc000006d\",\t\"This is either due to a bad username or authentication information\",\r\n\"0xc000018c\",\t\"The logon request failed because the trust relationship between the primary domain and the trusted domain failed.\",\r\n\"0xc000005e\",   \"There are currently no logon servers available to service the logon request.\",\r\n\"0xc00000dc\",\t\"Indicates the Sam Server was in the wrong state to perform the desired operation.\",\r\n\"0xc0000224\",\t\"user is required to change password at next logon\",\r\n\"0xc0000192\",\t\"An attempt was made to logon, but the netlogon service was not started.\",\r\n\"0xc0000413\",\t\"Logon Failure: The machine you are logging onto is protected by an authentication firewall. The specified account is not allowed to authenticate to the machine.\"\r\n];\r\nSecurityEvent\r\n| where EventID == 4625\r\n| lookup kind=leftouter ReasonTable on Status\r\n| project TimeGenerated, Account, Computer, IpAddress, ErrDescription \r\n| order by TimeGenerated desc",
                "Version": 2
              }
            },
            {              
              "type": "savedSearches",
              "apiVersion": "2017-04-26-preview",
              "name": "Scenario2 Clear Security log",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "properties": {
                "etag": "*",
                "Category": "Scenario2",
                "DisplayName": "Scenario2 - Clear Security log",
                "Query": "SecurityAlert\r\n| where TimeGenerated > ago(12h)\r\n| where DisplayName contains \"cleared\"\r\n| extend localTimeGenerated = TimeGenerated - (4h)",
                "Version": 2
              }
            },
            {              
              "type": "savedSearches",
              "apiVersion": "2017-04-26-preview",
              "name": "Scenario2 Portal Password Reset",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "properties": {
                "etag": "*",
                "Category": "Scenario2",
                "DisplayName": "Scenario2 - Portal Password Reset",
                "Query": "SecurityEvent\n| where TimeGenerated > ago(10m)\n| where Computer == 'scenario1VM'\n| where EventID == 4738\n| extend localTimeGenerated = TimeGenerated - (4h)\n| order by localTimeGenerated asc\n\nAzureActivity\n| where TimeGenerated > ago(10m)\n| where Caller contains \"scenario2\"\n| extend localTimeGenerated = TimeGenerated - (4h)\n| order by localTimeGenerated asc ",
                "Version": 2
              }
            },
            {              
              "type": "savedSearches",
              "apiVersion": "2017-04-26-preview",
              "name": "Scenario3 File Change",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "properties": {
                "etag": "*",
                "Category": "Scenario3",
                "DisplayName": "Scenario3 - File Change",
                "Query": "ConfigurationChange\r\n| where Computer == \"severn-lo000001\"\r\n| where ConfigChangeType in(\"Files\")\r\n| where TimeGenerated > ago(1h)\r\n| extend localTimeGenerated = TimeGenerated - (4h)\r\n| order by TimeGenerated\r\n| render table",
                "Version": 2
              }
            },
            {              
              "type": "savedSearches",
              "apiVersion": "2017-04-26-preview",
              "name": "Scenario3 Syslog Signin",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "properties": {
                "etag": "*",
                "Category": "Scenario3",
                "DisplayName": "Scenario3 - Syslog Signin",
                "Query": "Syslog\r\n| where Computer == \"severn-lo000001\"\r\n| where TimeGenerated > ago(2h)\r\n| where Facility contains \"auth\"\r\n| where SyslogMessage contains \"password\"\r\n| extend localTimeGenerate = TimeGenerated - (4h)\r\n| order by TimeGenerated\r\n| render table\r\n",
                "Version": 2
              }
            },
            {              
              "type": "savedSearches",
              "apiVersion": "2017-04-26-preview",
              "name": "Scenario4 File Upload to Storage",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "properties": {
                "etag": "*",
                "Category": "Scenario4",
                "DisplayName": "Scenario4 - File Upload to Storage",
                "Query": "StorageBlobLogs \n| where TimeGenerated > ago(1h)\n| where Category == \"StorageWrite\"\n| extend localTimeGenerated = TimeGenerated - (4h)\n| sort by localTimeGenerated desc \n",
                "Version": 2
              }
            },
            {              
              "type": "savedSearches",
              "apiVersion": "2017-04-26-preview",
              "name": "Scenario4 SSH Login",
              "dependsOn": [
                "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
              ],
              "properties": {
                "etag": "*",
                "Category": "Scenario4",
                "DisplayName": "Scenario4 SSH Login",
                "Query": "log_auth_CL\r\n| where TimeGenerated > ago(1h)\r\n| where Message contains \"scenario4ssh\"\r\n| extend localTimeGenerated = TimeGenerated - (4h)\r\n\r\nSyslog\r\n| where TimeGenerated > ago(1h)\r\n| where Facility == \"auth\"\r\n| where SyslogMessage contains \"scenario4ssh\"\r\n| extend localTimeGenerate = TimeGenerated - (4h)\r\n| order by TimeGenerated\r\n| render table",
                "Version": 2
              }
            }
          ]
        },
        {
          "type": "Microsoft.Automation/automationAccounts",
          "apiVersion": "2015-01-01-preview",
          "name": "[parameters('automationAccountName')]",
          "location": "[parameters('automationAccountLocation')]",
          "dependsOn": [],
          "tags": {},
          "properties": {
            "sku": {
              "name": "Basic"
            }
          }
        },
        {
          "apiVersion": "2015-11-01-preview",
          "type": "Microsoft.OperationalInsights/workspaces/linkedServices",
          "name": "[concat(variables('workspace-name'), '/' , 'Automation')]",
          "location": "[resourceGroup().location]",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]",
            "[concat('Microsoft.Automation/automationAccounts/', parameters('automationAccountName'))]"
          ],
          "properties": {
            "resourceId": "[resourceId('Microsoft.Automation/automationAccounts/', parameters('automationAccountName'))]"
          }
        },
        {
          "type": "Microsoft.OperationalInsights/workspaces/providers/locks",
          "apiVersion": "2016-09-01",
          "name": "[concat(variables('workspace-name'), '/Microsoft.Authorization/logAnalyticsDoNotDelete')]",
          "dependsOn": [
            "[variables('workspace-name')]"
          ],
          "comments": "Resource lock on Log Analytics",
          "properties": {
            "level": "CannotDelete"
          }
        },
        {
          "apiVersion": "2015-11-01-preview",
          "location": "[resourceGroup().location]",
          "name": "[concat(variables('solutionArray').solutions[copyIndex()].Name)]",
          "type": "Microsoft.OperationsManagement/solutions",
          "id": "[concat('/subscriptions/', subscription().subscriptionId, '/resourceGroups/', resourceGroup().name, '/providers/Microsoft.OperationsManagement/solutions/', variables('solutionArray').solutions[copyIndex()].Name)]",
          "dependsOn": [
            "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
          ],
          "copy": {
            "name": "solutionCopy",
            "count": "[length(variables('solutionArray').solutions)]"
          },
          "properties": {
            "workspaceResourceId": "[resourceId('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
          },
          "plan": {
            "name": "[variables('solutionArray').solutions[copyIndex()].Name]",
            "publisher": "Microsoft",
            "promotionCode": "",
            "product": "[concat('OMSGallery/', variables('solutionArray').solutions[copyIndex()].galleryName)]"
          }
        },
        {
          "apiVersion": "2018-06-17-preview",
          "location": "[resourceGroup().location]",
          "type": "microsoft.insights/workbooks",
          "name": "[parameters('workbookId')]",
          "dependsOn":[
            "[concat('Microsoft.OperationalInsights/workspaces/', variables('workspace-name'))]"
          ],
          "kind": "shared",
          "properties": {
            "displayName": "[variables('workbookDisplayName')]",
            "serializedData": "{\"version\":\"Notebook/1.0\",\"items\":[{\"type\":1,\"content\":{\"json\":\"## Severn Metrics - HDInsights Cluster\\n---\\n\"},\"customWidth\":\"100\",\"name\":\"text - 2\"},{\"type\":9,\"content\":{\"version\":\"KqlParameterItem/1.0\",\"parameters\":[{\"id\":\"e514370e-a145-46f9-bd70-094edbd9bb0c\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"Node\",\"label\":\"Select nodes\",\"type\":2,\"isRequired\":true,\"multiSelect\":true,\"quote\":\"'\",\"delimiter\":\",\",\"query\":\"InsightsMetrics\\r\\n| where Computer startswith \\\"wn\\\"\\r\\n| summarize by Computer\",\"value\":[\"value::all\"],\"typeSettings\":{\"additionalResourceOptions\":[\"value::all\"]},\"timeContext\":{\"durationMs\":86400000},\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},{\"id\":\"577f1682-57c7-47f6-927f-e7b549a47343\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"TimeRange\",\"type\":4,\"isRequired\":true,\"typeSettings\":{\"selectableValues\":[{\"durationMs\":3600000},{\"durationMs\":43200000},{\"durationMs\":86400000},{\"durationMs\":172800000},{\"durationMs\":259200000},{\"durationMs\":604800000},{\"durationMs\":2592000000}],\"allowCustom\":true},\"value\":{\"durationMs\":1800000}},{\"id\":\"c21d5a02-71ad-4ff7-8a37-eb73c3222c55\",\"version\":\"KqlParameterItem/1.0\",\"name\":\"Cluster\",\"type\":2,\"isRequired\":true,\"query\":\"application_stats_apps_CL \\r\\n| parse kind = regex flags = Ui _ResourceId with * \\\"resourcegroups/\\\" resourceName '/' *\\r\\n| summarize by ClusterName_s, resourceName\\r\\n| project value = resourceName, label = ClusterName_s\",\"value\":\"rg0-0d7483f94e754665ac49ebb3a18d0bddresourcegroup\",\"typeSettings\":{\"additionalResourceOptions\":[]},\"timeContext\":{\"durationMs\":0},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"}],\"style\":\"formHorizontal\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"customWidth\":\"33\",\"name\":\"parameters - 10\"},{\"type\":11,\"content\":{\"version\":\"LinkItem/1.0\",\"style\":\"list\",\"links\":[{\"cellValue\":\"https://portal.azure.com/#@severndemos.onmicrosoft.com/resource/subscriptions/7ea32f54-3e55-46c8-8950-a09270b2d7db/resourceGroups/severn-logging-rg/providers/microsoft.operationalinsights/workspaces/severn-laws/logs\",\"linkTarget\":\"Url\",\"linkLabel\":\"Workspace\",\"preText\":\"Log Analytics\",\"style\":\"link\"},{\"cellValue\":\"https://{Cluster:label}.azurehdinsight.net/\",\"linkTarget\":\"Url\",\"linkLabel\":\"Ambari Home\",\"preText\":\"HDI\",\"style\":\"link\"},{\"cellValue\":\"https://{Cluster:label}.azurehdinsight.net/#/main/views\",\"linkTarget\":\"Url\",\"linkLabel\":\"Ambari Views\",\"preText\":\"HDI\",\"style\":\"link\"}]},\"customWidth\":\"33\",\"name\":\"links - 11\"},{\"type\":1,\"content\":{\"json\":\"\"},\"customWidth\":\"33\",\"name\":\"text - 13\"},{\"type\":1,\"content\":{\"json\":\"## CPU\\n---\\n\"},\"customWidth\":\"33\",\"name\":\"text - 2 - Copy\"},{\"type\":1,\"content\":{\"json\":\"## Disk\\n---\\n\"},\"customWidth\":\"33\",\"name\":\"text - 2 - Copy - Copy\"},{\"type\":1,\"content\":{\"json\":\"## Network\\n---\\n\"},\"customWidth\":\"33\",\"name\":\"text - 2 - Copy - Copy - Copy\"},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"InsightsMetrics\\n| where Computer startswith \\\"hn\\\"\\n| where Name == \\\"UtilizationPercentage\\\"\\n| where _ResourceId contains \\\"{Cluster:value}\\\"\\n| project TimeGenerated, Name, Val , Computer \\n| summarize avg(Val) by Computer, bin(TimeGenerated, 1m)\\n| render timechart\\n\",\"size\":1,\"showAnnotations\":true,\"title\":\"Percentage CPU AVG - Head Nodes\",\"timeContext\":{\"durationMs\":1800000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"customWidth\":\"33\",\"name\":\"query - 2\",\"styleSettings\":{\"showBorder\":true}},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"InsightsMetrics \\n| where Namespace == \\\"LogicalDisk\\\"\\n| where Computer startswith \\\"wn\\\"\\n| where Name == \\\"ReadsPerSecond\\\" or Name == \\\"WritesPerSecond\\\"\\n| where Computer in ({Node})\\n| where _ResourceId contains \\\"{Cluster:value}\\\"\\n| project TimeGenerated, Name, Val \\n| summarize avg(Val) by Name, bin(TimeGenerated, 1m)\\n| render timechart\",\"size\":1,\"showAnnotations\":true,\"title\":\"Avg Disk Write Byte and Avg Disk Read Bytes - Workers\",\"timeContext\":{\"durationMs\":1800000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"customWidth\":\"33\",\"name\":\"query - 2 - Copy\",\"styleSettings\":{\"showBorder\":true}},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"InsightsMetrics \\n| where Namespace == \\\"Network\\\"\\n| where Computer startswith \\\"wn\\\"\\n| where Name == \\\"ReadBytesPerSecond\\\"\\n| where Computer in ({Node})\\n| where _ResourceId contains \\\"{Cluster:value}\\\"\\n| project TimeGenerated, Name, Val \\n| summarize sum(Val) by Name, bin(TimeGenerated, 1m)\\n| render timechart\",\"size\":1,\"showAnnotations\":true,\"title\":\"Sum Network Traffic In - Workers\",\"timeContext\":{\"durationMs\":1800000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"customWidth\":\"33\",\"name\":\"query - 2 - Copy - Copy\",\"styleSettings\":{\"showBorder\":true}},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"InsightsMetrics\\n| where Computer startswith \\\"wn\\\"\\n| where Name == \\\"UtilizationPercentage\\\"\\n| where Computer in ({Node})\\n| where _ResourceId contains \\\"{Cluster:value}\\\"\\n| project TimeGenerated, Name, Val, Computer \\n| summarize avg(Val) by Computer, bin(TimeGenerated, 1m)\\n| render timechart\",\"size\":1,\"showAnnotations\":true,\"title\":\"Percentage CPU AVG - Worker Nodes\",\"timeContext\":{\"durationMs\":1800000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"areachart\"},\"customWidth\":\"33\",\"name\":\"query - 2 - Copy - Copy - Copy\",\"styleSettings\":{\"showBorder\":true}},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"InsightsMetrics \\n| where Namespace == \\\"LogicalDisk\\\"\\n| where Computer startswith \\\"wn\\\"\\n| where Name == \\\"TransfersPerSecond\\\"\\n| where Computer in ({Node})\\n| where _ResourceId contains \\\"{Cluster:value}\\\"\\n| project TimeGenerated, Name, Val, Computer \\n| summarize sum(Val) by Computer, bin(TimeGenerated, 1m)\\n| render timechart\",\"size\":1,\"showAnnotations\":true,\"title\":\"Sum Disk Transactions by Worker\",\"timeContext\":{\"durationMs\":1800000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\",\"visualization\":\"areachart\"},\"customWidth\":\"33\",\"name\":\"query - 2 - Copy - Copy - Copy - Copy\",\"styleSettings\":{\"showBorder\":true}},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"InsightsMetrics \\n| where Namespace == \\\"Network\\\"\\n| where Computer startswith \\\"wn\\\"\\n| where Name == \\\"WriteBytesPerSecond\\\"\\n| where Computer in ({Node})\\n| where _ResourceId contains \\\"{Cluster:value}\\\"\\n| project TimeGenerated, Name, Val \\n| summarize sum(Val) by Name, bin(TimeGenerated, 1m)\\n| render timechart\",\"size\":1,\"showAnnotations\":true,\"title\":\"Sum Network Traffic Out - Workers\",\"timeContext\":{\"durationMs\":1800000},\"timeContextFromParameter\":\"TimeRange\",\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"customWidth\":\"33\",\"name\":\"query - 2 - Copy - Copy - Copy\",\"styleSettings\":{\"showBorder\":true}},{\"type\":3,\"content\":{\"version\":\"KqlItem/1.0\",\"query\":\"let ReasonTable=datatable(Status:string, ErrDescription:string) [ \\r\\n\\\"0xc000006d\\\",\\t\\\"This is either due to a bad username or authentication information\\\",\\r\\n\\\"0xc000006e\\\",\\t\\\"Unknown user name or bad password.\\\",\\r\\n\\\"0xc0000193\\\",\\t\\\"account expiration\\\",\\r\\n\\\"0xc000006d\\\",\\t\\\"This is either due to a bad username or authentication information\\\",\\r\\n\\\"0xc000018c\\\",\\t\\\"The logon request failed because the trust relationship between the primary domain and the trusted domain failed.\\\",\\r\\n\\\"0xc000005e\\\",   \\\"There are currently no logon servers available to service the logon request.\\\",\\r\\n\\\"0xc00000dc\\\",\\t\\\"Indicates the Sam Server was in the wrong state to perform the desired operation.\\\",\\r\\n\\\"0xc0000224\\\",\\t\\\"user is required to change password at next logon\\\",\\r\\n\\\"0xc0000192\\\",\\t\\\"An attempt was made to logon, but the netlogon service was not started.\\\",\\r\\n\\\"0xc0000413\\\",\\t\\\"Logon Failure: The machine you are logging onto is protected by an authentication firewall. The specified account is not allowed to authenticate to the machine.\\\"\\r\\n];\\r\\nSecurityEvent\\r\\n| where EventID == 4625\\r\\n| lookup kind=leftouter ReasonTable on Status\\r\\n| project TimeGenerated, Account, Computer, IpAddress, ErrDescription \\r\\n| order by TimeGenerated desc\",\"size\":0,\"timeContext\":{\"durationMs\":604800000},\"queryType\":0,\"resourceType\":\"microsoft.operationalinsights/workspaces\"},\"name\":\"Bastion Login Errors\"}],\"isLocked\":false,\"fallbackResourceIds\":[\"/subscriptions/7ea32f54-3e55-46c8-8950-a09270b2d7db/resourcegroups/severn-logging-rg/providers/microsoft.operationalinsights/workspaces/severn-laws\"],\"styleSettings\":{\"progressStyle\":\"spinner\"}}",
            "version": "1.0",
            "sourceId": "[resourceId('Microsoft.OperationalInsights/workspaces', variables('workspace-name'))]",
            "category": "workbook"
          }
        }
      ],
      "outputs": {
        "workspaceResourceId" : {
          "type": "string",
          "value": "[resourceId('Microsoft.OperationalInsights/workspaces', variables('workspace-name'))]"
        },
        "workspaceName" : {
          "type": "string",
          "value": "[variables('workspace-name')]"
        },
        "workbookId": {
          "type": "string",
          "value": "[resourceId( 'Microsoft.Insights/workbooks', parameters('workbookId'))]"
        }
      }
    },
    "resourceGroup": "ResourceGroup",
    "parameters": {
      "Organization_Name": {
        "value": "[parameters('createWorkspace_Organization_Name')]"
      },
      "data-retention": {
        "value": "[parameters('createWorkspace_data-retention')]"
      },
      "location": {
        "value": "[parameters('createWorkspace_location')]"
      },
      "automationAccountName": {
        "value": "[parameters('createWorkspace_automationAccountName')]"
      },
      "automationAccountLocation": {
        "value": "[parameters('createWorkspace_automationAccountLocation')]"
      }
    }
  }
}